/* automatically generated by rust-bindgen 0.70.1 */

pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::std::mem::size_of::<max_align_t>() - 32usize];
    ["Alignment of max_align_t"][::std::mem::align_of::<max_align_t>() - 16usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce1"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce1) - 0usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce2"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce2) - 16usize];
};
pub const jsmntype_t_JSMN_UNDEFINED: jsmntype_t = 0;
pub const jsmntype_t_JSMN_OBJECT: jsmntype_t = 1;
pub const jsmntype_t_JSMN_ARRAY: jsmntype_t = 2;
pub const jsmntype_t_JSMN_STRING: jsmntype_t = 4;
pub const jsmntype_t_JSMN_PRIMITIVE: jsmntype_t = 8;
#[doc = " JSON type identifier. Basic types are:\n \to Object\n \to Array\n \to String\n \to Other primitive: number, boolean (true/false) or null"]
pub type jsmntype_t = ::std::os::raw::c_uint;
pub const jsmnerr_JSMN_ERROR_NOMEM: jsmnerr = -1;
pub const jsmnerr_JSMN_ERROR_INVAL: jsmnerr = -2;
pub const jsmnerr_JSMN_ERROR_PART: jsmnerr = -3;
pub type jsmnerr = ::std::os::raw::c_int;
#[doc = " JSON token description.\n type\t\ttype (object, array, string etc.)\n start\tstart position in JSON data string\n end\t\tend position in JSON data string"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct jsmntok {
    pub type_: jsmntype_t,
    pub start: ::std::os::raw::c_int,
    pub end: ::std::os::raw::c_int,
    pub size: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of jsmntok"][::std::mem::size_of::<jsmntok>() - 16usize];
    ["Alignment of jsmntok"][::std::mem::align_of::<jsmntok>() - 4usize];
    ["Offset of field: jsmntok::type_"][::std::mem::offset_of!(jsmntok, type_) - 0usize];
    ["Offset of field: jsmntok::start"][::std::mem::offset_of!(jsmntok, start) - 4usize];
    ["Offset of field: jsmntok::end"][::std::mem::offset_of!(jsmntok, end) - 8usize];
    ["Offset of field: jsmntok::size"][::std::mem::offset_of!(jsmntok, size) - 12usize];
};
#[doc = " JSON token description.\n type\t\ttype (object, array, string etc.)\n start\tstart position in JSON data string\n end\t\tend position in JSON data string"]
pub type jsmntok_t = jsmntok;
#[doc = " JSON parser. Contains an array of token blocks available. Also stores\n the string being parsed now and current position in that string."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct jsmn_parser {
    pub pos: ::std::os::raw::c_uint,
    pub toknext: ::std::os::raw::c_uint,
    pub toksuper: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of jsmn_parser"][::std::mem::size_of::<jsmn_parser>() - 12usize];
    ["Alignment of jsmn_parser"][::std::mem::align_of::<jsmn_parser>() - 4usize];
    ["Offset of field: jsmn_parser::pos"][::std::mem::offset_of!(jsmn_parser, pos) - 0usize];
    ["Offset of field: jsmn_parser::toknext"]
        [::std::mem::offset_of!(jsmn_parser, toknext) - 4usize];
    ["Offset of field: jsmn_parser::toksuper"]
        [::std::mem::offset_of!(jsmn_parser, toksuper) - 8usize];
};
extern "C" {
    #[doc = " Create JSON parser over an array of tokens"]
    pub fn jsmn_init(parser: *mut jsmn_parser);
}
extern "C" {
    #[doc = " Run JSON parser. It parses a JSON data string into and array of tokens, each\n describing\n a single JSON object."]
    pub fn jsmn_parse(
        parser: *mut jsmn_parser,
        js: *const ::std::os::raw::c_char,
        len: usize,
        tokens: *mut jsmntok_t,
        num_tokens: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
