/* automatically generated by rust-bindgen 0.69.5 */

pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    const UNINIT: ::std::mem::MaybeUninit<max_align_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub const jsmntype_t_JSMN_UNDEFINED: jsmntype_t = 0;
pub const jsmntype_t_JSMN_OBJECT: jsmntype_t = 1;
pub const jsmntype_t_JSMN_ARRAY: jsmntype_t = 2;
pub const jsmntype_t_JSMN_STRING: jsmntype_t = 4;
pub const jsmntype_t_JSMN_PRIMITIVE: jsmntype_t = 8;
#[doc = " JSON type identifier. Basic types are:\n \to Object\n \to Array\n \to String\n \to Other primitive: number, boolean (true/false) or null"]
pub type jsmntype_t = ::std::os::raw::c_uint;
pub const jsmnerr_JSMN_ERROR_NOMEM: jsmnerr = -1;
pub const jsmnerr_JSMN_ERROR_INVAL: jsmnerr = -2;
pub const jsmnerr_JSMN_ERROR_PART: jsmnerr = -3;
pub type jsmnerr = ::std::os::raw::c_int;
#[doc = " JSON token description.\n type\t\ttype (object, array, string etc.)\n start\tstart position in JSON data string\n end\t\tend position in JSON data string"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct jsmntok {
    pub type_: jsmntype_t,
    pub start: ::std::os::raw::c_int,
    pub end: ::std::os::raw::c_int,
    pub size: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_jsmntok() {
    const UNINIT: ::std::mem::MaybeUninit<jsmntok> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<jsmntok>(),
        16usize,
        concat!("Size of: ", stringify!(jsmntok))
    );
    assert_eq!(
        ::std::mem::align_of::<jsmntok>(),
        4usize,
        concat!("Alignment of ", stringify!(jsmntok))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jsmntok),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(jsmntok),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(jsmntok),
            "::",
            stringify!(end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(jsmntok),
            "::",
            stringify!(size)
        )
    );
}
#[doc = " JSON token description.\n type\t\ttype (object, array, string etc.)\n start\tstart position in JSON data string\n end\t\tend position in JSON data string"]
pub type jsmntok_t = jsmntok;
#[doc = " JSON parser. Contains an array of token blocks available. Also stores\n the string being parsed now and current position in that string."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct jsmn_parser {
    pub pos: ::std::os::raw::c_uint,
    pub toknext: ::std::os::raw::c_uint,
    pub toksuper: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_jsmn_parser() {
    const UNINIT: ::std::mem::MaybeUninit<jsmn_parser> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<jsmn_parser>(),
        12usize,
        concat!("Size of: ", stringify!(jsmn_parser))
    );
    assert_eq!(
        ::std::mem::align_of::<jsmn_parser>(),
        4usize,
        concat!("Alignment of ", stringify!(jsmn_parser))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jsmn_parser),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).toknext) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(jsmn_parser),
            "::",
            stringify!(toknext)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).toksuper) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(jsmn_parser),
            "::",
            stringify!(toksuper)
        )
    );
}
extern "C" {
    #[doc = " Create JSON parser over an array of tokens"]
    pub fn jsmn_init(parser: *mut jsmn_parser);
}
extern "C" {
    #[doc = " Run JSON parser. It parses a JSON data string into and array of tokens, each\n describing\n a single JSON object."]
    pub fn jsmn_parse(
        parser: *mut jsmn_parser,
        js: *const ::std::os::raw::c_char,
        len: usize,
        tokens: *mut jsmntok_t,
        num_tokens: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
